tutorials/multiCompressionFoam/shockTube/shockTube_rhoCentralFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.025;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   5e-04;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;

maxDeltaT       1;

functions
{
    #includeFunc MachNo

    internalEnergy
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");
        writeControl    writeTime;
        objects
        (
            e
        );
    }
}

// ************************************************************************* //
